# vsoGetPluginStyleSym

## Description
Allow an object to use its own implementation in creating and maintaining a plugin style

```pascal
PROCEDURE vsoGetPluginStyleSym(VAR hSymDef : HANDLE);
```

```python
def vs.vsoGetPluginStyleSym():
    return hSymDef
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hSymDef|HANDLE|   |

## Version
Availability: from Vectorworks 2017

## Category
* Object Events